kossnikita/at32f4xx-pac/src/at32f402/at32f402.svd
        <register>
          <name>FBWCFG</name>
          <displayName>FBWCFG</displayName>
          <description>Filter bit width config register</description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>14</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-13</dimIndex>
              <name>SEL%s</name>
              <description>Filter bit width select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SEL0</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Dual</name>
                  <description>Dual 16-bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Single</name>
                  <description>Single 32-bit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRF</name>
          <displayName>FRF</displayName>
          <description>Filter related FIFO register</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>14</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-13</dimIndex>
              <name>SEL%s</name>
              <description>Filter relation FIFO select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SEL0</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Dual</name>
                  <description>Associated with FIFO0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Single</name>
                  <description>Associated with FIFO1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FACFG</name>
          <displayName>FACFG</displayName>
          <description>Filter activate configuration register</description>
          <addressOffset>0x21C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>14</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-13</dimIndex>
              <name>EN%s</name>
              <description>Filter activate enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EN0R</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Filter is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Filter is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>EN0W</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Filter disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Filter enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>14</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0-13</dimIndex>
          <name>FilterBank%s</name>
          <description>Filter Bank %s</description>
          <addressOffset>0x240</addressOffset>
          <register>
            <dim>2</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>1-2</dimIndex>
            <name>FFB%s</name>
            <displayName>F0FB1</displayName>
            <description>CAN filter bank filter bit register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <dim>32</dim>
                <dimIncrement>0x1</dimIncrement>
                <dimIndex>0-31</dimIndex>
                <name>FFDB%s</name>
                <description>Filter data bit</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <writeConstraint>
                  <range>
                    <minimum>0</minimum>
                    <maximum>4294967295</maximum>
                  </range>
                </writeConstraint>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>DEBUG</name>
      <description>Debug support</description>
      <groupName>DEBUG</groupName>
      <baseAddress>0xE0042000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IDCODE</name>
          <displayName>IDCODE</displayName>
          <description>DEBUG IDCODE</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PID</name>
              <description>PID information</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <displayName>CTRL</displayName>
          <description>DEBUG CTRL</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SLEEP_DEBUG</name>
              <description>Debug Sleep mode control bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SLEEP_DEBUGR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>When entering Sleep mode, CPU HCLK clock is disabled, but other clocks remain active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>When entering Sleep mode, all clocks keep running</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>SLEEP_DEBUGW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>When entering Sleep mode, CPU HCLK clock is disabled, but other clocks remain active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>When entering Sleep mode, all clocks keep running</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEEPSLEEP_DEBUG</name>
              <description>Debug Deepsleep mode control bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DEEPSLEEP_DEBUGR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>In Deepsleep mode, all clocks in the 1.2V domain are disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>In Deepsleep mode, system clock is provided by the internal RC oscillator (HICK)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>DEEPSLEEP_DEBUGW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>In Deepsleep mode, all clocks in the 1.2V domain are disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>In Deepsleep mode, system clock is provided by the internal RC oscillator (HICK)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STANDBY_DEBUG</name>
              <description>Debug Standby mode control bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>STANDBY_DEBUGR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The whole 1.2V digital circuit is unpowered in Standby mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The whole 1.2V digital circuit is not unpowered in Standby mode, and the system clock is provided by the internal RC oscillator (HICK)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>STANDBY_DEBUGW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>The whole 1.2V digital circuit is unpowered in Standby mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>The whole 1.2V digital circuit is not unpowered in Standby mode, and the system clock is provided by the internal RC oscillator (HICK)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1_PAUSE</name>
          <displayName>APB1_PAUSE</displayName>
          <description>DEBUG APB1 PAUSE</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMR2_PAUSE</name>
              <description>TMR2_PAUSE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR3_PAUSE</name>
              <description>TMR3_PAUSE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR4_PAUSE</name>
              <description>TMR4_PAUSE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR6_PAUSE</name>
              <description>TMR6_PAUSE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR7_PAUSE</name>
              <description>TMR7_PAUSE</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR13_PAUSE</name>
              <description>TMR13_PAUSE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR14_PAUSE</name>
              <description>TMR14_PAUSE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERTC_PAUSE</name>
              <description>ERTC_PAUSE</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WWDT_PAUSE</name>
              <description>WWDT_PAUSE</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDT_PAUSE</name>
              <description>WDT_PAUSE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERTC512_PAUSE</name>
              <description>ERTC512_PAUSE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1_SMBUS_TIMEOUT</name>
              <description>I2C1_SMBUS_TIMEOUT</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAN1_PAUSE</name>
              <description>CAN1_PAUSE</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C2_SMBUS_TIMEOUT</name>
              <description>I2C2_SMBUS_TIMEOUT</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3_SMBUS_TIMEOUT</name>
              <description>I2C3_SMBUS_TIMEOUT</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2_PAUSE</name>
          <displayName>APB2_PAUSE</displayName>
          <description>DEBUG APB2 PAUSE</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMR1_PAUSE</name>
              <description>TMR1_PAUSE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR9_PAUSE</name>
              <description>TMR9_PAUSE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR10_PAUSE</name>
              <description>TMR10_PAUSE</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR11_PAUSE</name>
              <description>TMR11_PAUSE</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
